{
  "id_to_token": [
    "<PAD>",
    "<BOS>",
    "<EOS>",
    "<Think>",
    "<ANS>",
    "X",
    "Y",
    "Z",
    "N0",
    "N1",
    "N2",
    "N3",
    "N4",
    "N5",
    "N6",
    "N7",
    "N8",
    "N9",
    "N10",
    "N11",
    "N12",
    "N13",
    "N14",
    "N15",
    "N16",
    "N17",
    "N18",
    "N19",
    "N20",
    "N21",
    "N22",
    "N23",
    "N24",
    "N25",
    "N26",
    "N27",
    "N28",
    "N29",
    "N30",
    "N31",
    "N32",
    "N33",
    "N34",
    "N35",
    "N36",
    "N37",
    "N38",
    "N39",
    "N40",
    "N41",
    "N42",
    "N43",
    "N44",
    "N45",
    "N46",
    "N47",
    "N48",
    "N49",
    "N50",
    "N51",
    "N52",
    "N53",
    "N54",
    "N55",
    "N56",
    "N57",
    "N58",
    "N59",
    "N60",
    "N61",
    "N62",
    "N63",
    "<I1>",
    "<I2>",
    "<I3>",
    "<I4>",
    "<I5>",
    "<I6>",
    "<I7>",
    "<I8>",
    "<I9>",
    "<I10>",
    "<I11>",
    "<I12>",
    "<I13>",
    "<I14>",
    "<I15>",
    "<I16>",
    "<I17>",
    "<I18>",
    "<I19>",
    "<I20>",
    "<I21>",
    "<I22>",
    "<I23>",
    "<I24>",
    "<I25>",
    "<I26>",
    "<I27>",
    "<I28>",
    "<I29>",
    "<I30>",
    "<I31>",
    "<I32>",
    "<I33>",
    "<I34>",
    "<I35>",
    "<I36>",
    "<I37>",
    "<I38>",
    "<I39>",
    "<I40>",
    "<I41>",
    "<I42>",
    "<I43>",
    "<I44>",
    "<I45>",
    "<I46>",
    "<I47>",
    "<I48>",
    "<I49>",
    "<I50>",
    "<I51>",
    "<I52>",
    "<I53>",
    "<I54>",
    "<I55>",
    "<I56>",
    "<I57>",
    "<I58>",
    "<I59>",
    "<I60>",
    "<I61>",
    "<I62>",
    "<I63>",
    "<I64>",
    "<C0>",
    "<C1>",
    "<C2>",
    "<C3>",
    "<C4>",
    "<C5>",
    "<C6>",
    "<C7>",
    "<C8>",
    "<C9>",
    "<C10>",
    "<C11>",
    "<C12>",
    "<C13>",
    "<C14>",
    "<C15>",
    "<C16>",
    "<C17>",
    "<C18>",
    "<C19>",
    "<C20>",
    "<C21>",
    "<C22>",
    "<C23>",
    "<C24>",
    "<C25>",
    "<C26>",
    "<C27>",
    "<C28>",
    "<C29>",
    "<C30>",
    "<C31>",
    "<C32>",
    "<C33>",
    "<C34>",
    "<C35>",
    "<C36>",
    "<C37>",
    "<C38>",
    "<C39>",
    "<C40>",
    "<C41>",
    "<C42>",
    "<C43>",
    "<C44>",
    "<C45>",
    "<C46>",
    "<C47>",
    "<C48>",
    "<C49>",
    "<C50>",
    "<C51>",
    "<C52>",
    "<C53>",
    "<C54>",
    "<C55>",
    "<C56>",
    "<C57>",
    "<C58>",
    "<C59>",
    "<C60>",
    "<C61>",
    "<C62>",
    "<C63>",
    "<C64>"
  ],
  "metadata": {
    "max_count": 64,
    "noise_vocab_size": 64,
    "positive_vocab": [
      "X",
      "Y",
      "Z"
    ]
  },
  "token_to_id": {
    "<ANS>": 4,
    "<BOS>": 1,
    "<C0>": 136,
    "<C10>": 146,
    "<C11>": 147,
    "<C12>": 148,
    "<C13>": 149,
    "<C14>": 150,
    "<C15>": 151,
    "<C16>": 152,
    "<C17>": 153,
    "<C18>": 154,
    "<C19>": 155,
    "<C1>": 137,
    "<C20>": 156,
    "<C21>": 157,
    "<C22>": 158,
    "<C23>": 159,
    "<C24>": 160,
    "<C25>": 161,
    "<C26>": 162,
    "<C27>": 163,
    "<C28>": 164,
    "<C29>": 165,
    "<C2>": 138,
    "<C30>": 166,
    "<C31>": 167,
    "<C32>": 168,
    "<C33>": 169,
    "<C34>": 170,
    "<C35>": 171,
    "<C36>": 172,
    "<C37>": 173,
    "<C38>": 174,
    "<C39>": 175,
    "<C3>": 139,
    "<C40>": 176,
    "<C41>": 177,
    "<C42>": 178,
    "<C43>": 179,
    "<C44>": 180,
    "<C45>": 181,
    "<C46>": 182,
    "<C47>": 183,
    "<C48>": 184,
    "<C49>": 185,
    "<C4>": 140,
    "<C50>": 186,
    "<C51>": 187,
    "<C52>": 188,
    "<C53>": 189,
    "<C54>": 190,
    "<C55>": 191,
    "<C56>": 192,
    "<C57>": 193,
    "<C58>": 194,
    "<C59>": 195,
    "<C5>": 141,
    "<C60>": 196,
    "<C61>": 197,
    "<C62>": 198,
    "<C63>": 199,
    "<C64>": 200,
    "<C6>": 142,
    "<C7>": 143,
    "<C8>": 144,
    "<C9>": 145,
    "<EOS>": 2,
    "<I10>": 81,
    "<I11>": 82,
    "<I12>": 83,
    "<I13>": 84,
    "<I14>": 85,
    "<I15>": 86,
    "<I16>": 87,
    "<I17>": 88,
    "<I18>": 89,
    "<I19>": 90,
    "<I1>": 72,
    "<I20>": 91,
    "<I21>": 92,
    "<I22>": 93,
    "<I23>": 94,
    "<I24>": 95,
    "<I25>": 96,
    "<I26>": 97,
    "<I27>": 98,
    "<I28>": 99,
    "<I29>": 100,
    "<I2>": 73,
    "<I30>": 101,
    "<I31>": 102,
    "<I32>": 103,
    "<I33>": 104,
    "<I34>": 105,
    "<I35>": 106,
    "<I36>": 107,
    "<I37>": 108,
    "<I38>": 109,
    "<I39>": 110,
    "<I3>": 74,
    "<I40>": 111,
    "<I41>": 112,
    "<I42>": 113,
    "<I43>": 114,
    "<I44>": 115,
    "<I45>": 116,
    "<I46>": 117,
    "<I47>": 118,
    "<I48>": 119,
    "<I49>": 120,
    "<I4>": 75,
    "<I50>": 121,
    "<I51>": 122,
    "<I52>": 123,
    "<I53>": 124,
    "<I54>": 125,
    "<I55>": 126,
    "<I56>": 127,
    "<I57>": 128,
    "<I58>": 129,
    "<I59>": 130,
    "<I5>": 76,
    "<I60>": 131,
    "<I61>": 132,
    "<I62>": 133,
    "<I63>": 134,
    "<I64>": 135,
    "<I6>": 77,
    "<I7>": 78,
    "<I8>": 79,
    "<I9>": 80,
    "<PAD>": 0,
    "<Think>": 3,
    "N0": 8,
    "N1": 9,
    "N10": 18,
    "N11": 19,
    "N12": 20,
    "N13": 21,
    "N14": 22,
    "N15": 23,
    "N16": 24,
    "N17": 25,
    "N18": 26,
    "N19": 27,
    "N2": 10,
    "N20": 28,
    "N21": 29,
    "N22": 30,
    "N23": 31,
    "N24": 32,
    "N25": 33,
    "N26": 34,
    "N27": 35,
    "N28": 36,
    "N29": 37,
    "N3": 11,
    "N30": 38,
    "N31": 39,
    "N32": 40,
    "N33": 41,
    "N34": 42,
    "N35": 43,
    "N36": 44,
    "N37": 45,
    "N38": 46,
    "N39": 47,
    "N4": 12,
    "N40": 48,
    "N41": 49,
    "N42": 50,
    "N43": 51,
    "N44": 52,
    "N45": 53,
    "N46": 54,
    "N47": 55,
    "N48": 56,
    "N49": 57,
    "N5": 13,
    "N50": 58,
    "N51": 59,
    "N52": 60,
    "N53": 61,
    "N54": 62,
    "N55": 63,
    "N56": 64,
    "N57": 65,
    "N58": 66,
    "N59": 67,
    "N6": 14,
    "N60": 68,
    "N61": 69,
    "N62": 70,
    "N63": 71,
    "N7": 15,
    "N8": 16,
    "N9": 17,
    "X": 5,
    "Y": 6,
    "Z": 7
  }
}
